# Asset Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Asset Properties
Asset Class See Also
---
The Asset type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AssetType | The type of RenderingAsset |
| IsReadOnly | Identifies if the object is read-only or modifiable. If true, the object may not be modified. If false, the object's contents may be modified.  (Inherited from AssetProperty.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from AssetProperty.) |
| Item | (Inherited from AssetProperties.) |
| LibraryName | Library name |
| Name | Get the name of the AssetProperty (Inherited from AssetProperty.) |
| NumberOfConnectedProperties | The number of currently connected properties.  (Inherited from AssetProperty.) |
| Size | The number of the AssetProperty(s) in the object.  (Inherited from AssetProperties.) |
| Title | Asset title |
| Type | Returns the type of the AssetProperty (Inherited from AssetProperty.) |

# See Also
Asset Class
Autodesk.Revit.DB.Visual Namespace